Project/Toir.Adaptation/src/InformationRegisters/торо_ОчередьУведомлений/торо_ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05bc7005-d271-4d0f-b978-6222cabdae7e">
  <name>торо_ОчередьУведомлений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c3b14dd5-d2d8-44f5-9a6a-fb1a98b70549">
    <name>ТемаПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e3558519-e6a8-4b99-8f7c-9ccdc68cc619">
    <name>ТелоПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="f406dd60-181a-49b4-b5f3-066d4214c6ed">
    <name>ОписаниеОшибки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="a2afda4c-62a0-4acd-b681-a3d6cfd51238">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cfca17f5-e0b8-4af8-9a61-550dda4d9180">
    <name>ID_уведомления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="6df3c419-054f-4c0b-97fb-0e373cda0788">
    <name>СпособУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="33d9092d-8133-4d9d-906c-992514b33041">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_СпособыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="02bc949c-5e4c-4b15-83c1-a8495643e26c">
    <name>ПорядокСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="69807f2d-19a0-4039-9d55-8a6629b3ee9a">
      <name>гкс_ПроводитьАвтоматически</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3f7b11a-33d2-425a-b6b6-a3b9d3451f37">
      <name>ПроведениеДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="304f1d2e-c348-4b56-9d54-9d830aeb8100">
      <name>ТекущийСтатус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13294823-5282-48a7-ae3c-3980d87974ff">
      <name>Пользователь</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/торо_РаботаСУведомлениями/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Заполняет шаблон письма данными.
// Параметры:
//  СтруктураДанных - Структура - Структура параметров для подстановки.
Процедура ЗаписатьУведомленияФМ(СтруктураДанных, Событие)Экспорт
	НаборЗаписей = РегистрыСведений.торо_ОчередьУведомлений.СоздатьНаборЗаписей();
	
	МассивОповещаемых = Новый Массив;
	МассивЗаполнен = Ложь;
	
	Если Событие.ФормироватьВсплывающиеУведомления Тогда
		СформироватьУведомление(НаборЗаписей, СтруктураДанных, Событие, МассивОповещаемых, МассивЗаполнен,
		Перечисления.торо_СпособыУведомленияПользователей.УведомлениеВВидеВсплывающейПодсказки);
	КонецЕсли;
	
	Если Событие.ФормироватьПочтовыеУведомления Тогда
		СформироватьУведомление(НаборЗаписей, СтруктураДанных, Событие, МассивОповещаемых, МассивЗаполнен,
		Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте);
	КонецЕсли;
	
	НачатьТранзакцию();
	ОшибкаВТранзакции = Ложь;
	Попытка
		Для каждого Строка из НаборЗаписей Цикл
			МенеджерЗаписи = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	Исключение
		ОшибкаВТранзакции = Истина;
		ЗаписьЖурналаРегистрации("ФормированиеУведомлений", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
	Если ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

// Гкс+[TOIR20-170] Селимов 
Процедура ЗаписатьУведомленияТК(СтруктураДанных, Событие) Экспорт
	
	НаборЗаписей = РегистрыСведений.торо_ОчередьУведомлений.СоздатьНаборЗаписей();
	
	Если Событие.ФормироватьВсплывающиеУведомления Тогда
		СформироватьУведомлениеТК(НаборЗаписей, СтруктураДанных, Событие, 
		Перечисления.торо_СпособыУведомленияПользователей.УведомлениеВВидеВсплывающейПодсказки);
	КонецЕсли;
	
	Если Событие.ФормироватьПочтовыеУведомления Тогда
		СформироватьУведомлениеТК(НаборЗаписей, СтруктураДанных, Событие, 
		Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте);
	КонецЕсли;
	
	НачатьТранзакцию();
	ОшибкаВТранзакции = Ложь;
	Попытка
		Для каждого Строка из НаборЗаписей Цикл
			МенеджерЗаписи = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	Исключение
		ОшибкаВТранзакции = Истина;
		ЗаписьЖурналаРегистрации("ФормированиеУведомлений", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
	Если ОшибкаВТранзакции Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
		
КонецПроцедуры  

// Гкс+[TOIR20-170] Селимов
Процедура СформироватьУведомлениеТК(НаборЗаписей, СтруктураДанных, Событие, СпособУведомления)
	
	СсылкаНаИсточник = СтруктураДанных.Ссылка;
	ОповещаемыеПользователи = СтруктураДанных.ОповещаемыеПользователи;
	МассивОповещаемыхЗаполнен = ОповещаемыеПользователи.Количество() > 0;
	
	Для каждого Строка из Событие.Оповещаемые Цикл
		
		ID_уведомления = Новый  УникальныйИдентификатор;
		
		Если ТипЗнч(Строка.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			
			НС = НаборЗаписей.Добавить();
			
			СтруктураПисьма = ПолучитьСодержимоеПисьмаПоШаблону(Событие.ШаблонСообщения, Строка.Пользователь, СтруктураДанных);
			
			НС.ТемаПисьма        = СтруктураПисьма.ТемаУведомления;
			НС.ТелоПисьма        = СтруктураПисьма.ТелоУведомления;
			
			НС.ID_уведомления    = ID_уведомления;
			НС.Источник          = СсылкаНаИсточник;
			НС.Пользователь      = Строка.Пользователь;
			НС.СпособУведомления = СпособУведомления;
			
		ИначеЕсли ТипЗнч(Строка.Пользователь) = Тип("Строка") Тогда
			
			ТолькоПользователи = (СпособУведомления <> Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте);
			
			Если Не МассивОповещаемыхЗаполнен Тогда
				МассивОповещаемых = ПолучитьСписокОповещаемых(Строка.Пользователь, СсылкаНаИсточник, СтруктураДанных, ТолькоПользователи);
				МассивОповещаемыхЗаполнен = Истина;
			КонецЕсли;   
			
			Если ОповещаемыеПользователи = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Для Каждого Оповещаемый Из ОповещаемыеПользователи Цикл
				
				Если ТипЗнч(Оповещаемый) = Тип("Структура") Тогда
					
					Если СтруктураДанных.Свойство("СледующийСтатусДокумента") Тогда
						СтруктураДанных.СледующийСтатусДокумента = Оповещаемый.СледующийСтатусДокумента;
					Иначе
						СтруктураДанных.Вставить("СледующийСтатусДокумента", Оповещаемый.СледующийСтатусДокумента);
					КонецЕсли;
					
					Адресат = Оповещаемый.Пользователь;
				ИначеЕсли ТипЗнч(Оповещаемый) = Тип("КлючИЗначение") Тогда
					Адресат = Оповещаемый.Ключ; 	
					СтруктураДанных.Вставить("ТехКарты", Оповещаемый.Значение);
				Иначе                          					
					Адресат = Оповещаемый;     					
				КонецЕсли;
				
				СтруктураПисьма = ПолучитьСодержимоеПисьмаПоШаблону(Событие.ШаблонСообщения, Адресат, СтруктураДанных);
				
				// Была проблема с возможным созданием записей с одинаковыми измерениями, что вело к ошибке
				// Исправлено следующим костылем:
				ИзмеренияРегистраСтрокой = "Пользователь, ID_уведомления, СпособУведомления, Источник";
				НайденныеСтрокиССовпадающимиИзмерениями = НаборЗаписей.Выгрузить().НайтиСтроки(Новый Структура(ИзмеренияРегистраСтрокой, Адресат, Строка(ID_уведомления), СпособУведомления, СсылкаНаИсточник));
				Если НайденныеСтрокиССовпадающимиИзмерениями.Количество() > 0 Тогда
					УжеЗаписаныТемаИТекстПисьма = Ложь;
					Для Каждого НайденнаяСтрока Из НайденныеСтрокиССовпадающимиИзмерениями Цикл
						Если НайденнаяСтрока.ТемаПисьма = СтруктураПисьма.ТемаУведомления И НайденнаяСтрока.ТелоПисьма = СтруктураПисьма.ТелоУведомления Тогда
							УжеЗаписаныТемаИТекстПисьма = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если УжеЗаписаныТемаИТекстПисьма Тогда
						Продолжить;
					Иначе
						ID_уведомления = Новый УникальныйИдентификатор;
					КонецЕсли;
				КонецЕсли;
				//
				
				НС = НаборЗаписей.Добавить();

				НС.ТемаПисьма        = СтруктураПисьма.ТемаУведомления;
				НС.ТелоПисьма        = СтруктураПисьма.ТелоУведомления;
				
				НС.ID_уведомления    = ID_уведомления;
				НС.Источник          = СсылкаНаИсточник;
				НС.Пользователь      = Адресат;
				НС.СпособУведомления = СпособУведомления;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры  

// гкс+ [разработка 2021] Куст 
Процедура гкс_ЗаписатьУведомленияСрокаСогласования(Документ, Событие, Оповещаемые, Отказ = Ложь, ДопСвойства = Неопределено) Экспорт
	СтруктураДанных = Новый Структура();
	Источник = Документ.ПолучитьОбъект();
	ЗаполнитьСтруктуруДанныхДокумента(СтруктураДанных, Источник);
	СтруктураДанных.Вставить("ВидДокумента",СокрЛП(Источник.Метаданные().Имя));
	СтруктураДанных.Вставить("гкс_Оповещаемые", Оповещаемые);
	// гкс+ [11.22] Деснол 17.11.2022
	Если Не ДопСвойства = Неопределено Тогда 
		Для Каждого СтрокаМассива Из ДопСвойства Цикл
			СтруктураДанных.Вставить(СтрокаМассива.Ключ, СтрокаМассива.Значение);
		КонецЦикла;
	КонецЕсли;
	// гкс- [11.22] Деснол 17.11.2022
	//
	НаборЗаписей = РегистрыСведений.торо_ОчередьУведомлений.СоздатьНаборЗаписей();
	МассивОповещаемых = Новый Массив;
	МассивЗаполнен = Ложь;
	
	Если Событие.ФормироватьВсплывающиеУведомления Тогда
		СформироватьУведомление(НаборЗаписей,СтруктураДанных,Событие,МассивОповещаемых,МассивЗаполнен,
			Перечисления.торо_СпособыУведомленияПользователей.УведомлениеВВидеВсплывающейПодсказки);
	КонецЕсли;
	
	Если Событие.ФормироватьПочтовыеУведомления Тогда
		СформироватьУведомление(НаборЗаписей,СтруктураДанных,Событие,МассивОповещаемых,МассивЗаполнен,
			Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте);
	КонецЕсли;
	
	НачатьТранзакцию();
	ОшибкаВТранзакции = Ложь;
	Попытка
		Для каждого Строка из НаборЗаписей Цикл
			МенеджерЗаписи = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОшибкаВТранзакции = Истина;
		ЗаписьЖурналаРегистрации("ФормированиеУведомлений", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьСписокОповещаемых")
Функция гкс_ПолучитьСписокОповещаемых(СтрокаОповещаемых, Источник, СтруктураДанных, ТолькоПользователей)

	МассивОповещаемых = Новый Массив;

	Если СтрокаОповещаемых = "Ответственный по документу" Тогда

		МассивОповещаемых.Добавить(СтруктураДанных.Ответственный);

		Возврат МассивОповещаемых;

	#Вставка
	ИначеЕсли СтрокаОповещаемых = "Оповещаемые о сроке согласования" Тогда
		Если СтруктураДанных.Свойство("гкс_Оповещаемые") Тогда 
			ТемпМассив = Новый Массив();
			Если ТолькоПользователей Тогда 
				ТипПользователь = Тип("СправочникСсылка.Пользователи");
				Для Каждого СтрокаМассива Из СтруктураДанных.гкс_Оповещаемые Цикл
					Если ТипЗнч(СтрокаМассива) = ТипПользователь Тогда 
						ТемпМассив.Добавить(СтрокаМассива);
					КонецЕсли;
				КонецЦикла;
			Иначе
				ТипСтрока = Тип("Строка");
				Для Каждого СтрокаМассива Из СтруктураДанных.гкс_Оповещаемые Цикл
					Если ТипЗнч(СтрокаМассива) = ТипСтрока Тогда 
						ТемпМассив.Добавить(СтрокаМассива);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Возврат ТемпМассив;
		Иначе
			Возврат МассивОповещаемых;
		КонецЕсли;
	#КонецВставки
	ИначеЕсли СтрокаОповещаемых = "Согласующие" Тогда

		РегламентныйДокумент = (СтруктураДанных.ВидДокумента = "торо_ГрафикРегламентныхМероприятийТОиР"
		ИЛИ СтруктураДанных.ВидДокумента = "торо_НарядНаРегламентноеМероприятие"
		ИЛИ СтруктураДанных.ВидДокумента = "торо_АктОВыполненииРегламентногоМероприятия");

		Если торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(СтруктураДанных.ВидДокумента, РегламентныйДокумент)
			И СтруктураДанных.Свойство("СпособСогласования") И ЗначениеЗаполнено(СтруктураДанных.СпособСогласования)
			И СтруктураДанных.Свойство("СтатусДокумента") Тогда

			Если Не ЗначениеЗаполнено(СтруктураДанных.СтатусДокумента) Тогда
				СтруктураДанных.СтатусДокумента = торо_РаботаССогласованиями.ПолучитьНачальныйСтатус(СтруктураДанных.СпособСогласования);
			КонецЕсли;

			СписокСледующихСтатусов = торо_РаботаССогласованиями.ПолучитьСписокСледующихСтатусовДокумента(СтруктураДанных.СпособСогласования, СтруктураДанных.СтатусДокумента);

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_СпособыСогласованияДокументовПорядокСогласования.Пользователь,
			|	торо_СпособыСогласованияДокументовПорядокСогласования.ТекущийСтатус
			|ИЗ
			|	Справочник.торо_СпособыСогласованияДокументов.ПорядокСогласования КАК торо_СпособыСогласованияДокументовПорядокСогласования
			|ГДЕ
			|	торо_СпособыСогласованияДокументовПорядокСогласования.Ссылка = &Ссылка
			|	И торо_СпособыСогласованияДокументовПорядокСогласования.ТекущийСтатус В(&СписокСледующихСтатусов)";


			Запрос.УстановитьПараметр("Ссылка"                  , СтруктураДанных.СпособСогласования);
			Запрос.УстановитьПараметр("СписокСледующихСтатусов" , СписокСледующихСтатусов);

			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл

				МассивОповещаемых.Добавить(Новый Структура("СледующийСтатусДокумента, Пользователь", Выборка.ТекущийСтатус, Выборка.Пользователь));

			КонецЦикла;


			Возврат МассивОповещаемых;

		КонецЕсли;
		// Ветка для получения e-mail адресов со вкладки "Оповещаемые лица" настройки способа согласования.
		// Получаем адреса всех оповещаемых лиц следующих статусов документа. Так как указаны не пользователи,
		// имеет смысл только для уведомлений на почту.
	ИначеЕсли СтрокаОповещаемых = "Оповещаемые" И Не ТолькоПользователей Тогда

		РегламентныйДокумент = (СтруктураДанных.ВидДокумента = "торо_ГрафикРегламентныхМероприятийТОиР"
		ИЛИ СтруктураДанных.ВидДокумента = "торо_НарядНаРегламентноеМероприятие"
		ИЛИ СтруктураДанных.ВидДокумента = "торо_АктОВыполненииРегламентногоМероприятия");

		Если торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(СтруктураДанных.ВидДокумента, РегламентныйДокумент)
			И СтруктураДанных.Свойство("СпособСогласования") И ЗначениеЗаполнено(СтруктураДанных.СпособСогласования)
			И СтруктураДанных.Свойство("СтатусДокумента") Тогда

			Если Не ЗначениеЗаполнено(СтруктураДанных.СтатусДокумента) Тогда
				СтруктураДанных.СтатусДокумента = торо_РаботаССогласованиями.ПолучитьНачальныйСтатус(СтруктураДанных.СпособСогласования);
			КонецЕсли;

			Запрос = Новый Запрос("ВЫБРАТЬ
			|	торо_СпособыСогласованияДокументовОповещаемыеЛица.АдресЭлектроннойПочты КАК Пользователь,
			|	торо_СпособыСогласованияДокументовОповещаемыеЛица.ТекущийСтатус
			|ИЗ
			|	Справочник.торо_СпособыСогласованияДокументов.ОповещаемыеЛица КАК торо_СпособыСогласованияДокументовОповещаемыеЛица
			|ГДЕ
			|	торо_СпособыСогласованияДокументовОповещаемыеЛица.Ссылка = &Ссылка
			|	И торо_СпособыСогласованияДокументовОповещаемыеЛица.ТекущийСтатус В(&СписокСледующихСтатусов)");


			Запрос.УстановитьПараметр("Ссылка"                  , СтруктураДанных.СпособСогласования);
			Запрос.УстановитьПараметр("СписокСледующихСтатусов" , СтруктураДанных.СтатусДокумента);

			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл

				МассивОповещаемых.Добавить(Новый Структура("СледующийСтатусДокумента, Пользователь", Выборка.ТекущийСтатус, Выборка.Пользователь));

			КонецЦикла;


			Возврат МассивОповещаемых;

		КонецЕсли;

	КонецЕсли;

	// Возвращаем пустой массив если не попали ни в одну ветку, для избежания ошибок.
	Возврат МассивОповещаемых;

КонецФункции
     

#КонецОбласти
